/*

输入一个三位数， 分离出它的百位、 十位和个位， 反转后输出;
样例输入：
127
样例输出：
721

 */

//首先将三位数读入变量n， 然后进行分离。 百位等于n/100（ 注意这里取的是商的整数部
//分） ， 十位等于n / 10 % 10（ 这里的 % 是取余数操作） ， 个位等于n % 10。

#include <stdio.h>
int main()
{
    int n;
    scanf("%d", &n);
    printf("%d%d%d\n", n % 10, n / 10 % 10, n / 100);
    return 0;
}

/*
此题有一个没有说清楚的细节， 即： 如果个位是0， 反转后应该输出吗？ 例如， 输入是
520， 输出是025还是25？ 如果在算法竞赛中遇到这样的问题， 可向监考人员询问(4)。 但是在
这里， 两种情况的处理方法都应学会。
 */
/* 

#include <stdio.h>
int main()
{
    int n, m;
    scanf("%d", &n);
    m = (n % 10) * 100 + (n / 10 % 10) * 10 + (n / 100);
    printf("%03d\n", m);
    return 0;
}

*/
